Revit 2026 API

# SpaceDesignPowerLoad Property

---

Get or set the Design Power Load of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double DesignPowerLoad { get; set; }
```
```vb
Public Property DesignPowerLoad As Double
	Get
	Set
```
```cpp
public:
property double DesignPowerLoad {
	double get ();
	void set (double value);
}
```
```fsharp
member DesignPowerLoad : float with get, set
```

#### Property Value

Double

This property is used to get or set the Design Power Load of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace